spamjam_backend/app/models/spam_email.rb

SELECT "spam_emails".* FROM "spam_emails"
---
  def self.favorite_type
    new_hash = Hash.new(0)
    SpamEmail.all.each do |email|