spamjam_backend/app/controllers/spam_types_controller.rb

  def index
    @spam_types = SpamType.all
---
SELECT "spam_types".* FROM "spam_types"