spamjam_backend/app/controllers/spam_emails_controller.rb

  def create
    byebug
    @spam_type = SpamType.find_by(name: params[:type])
---
SELECT  "spam_types".* FROM "spam_types" WHERE "spam_types"."name" = $1 LIMIT $2  [["name", "FBI/CIA/IRS Arrest Warrant"], ["LIMIT", 1]]