spamjam_backend/app/controllers/spam_emails_controller.rb

SELECT "spam_emails".* FROM "spam_emails"
---
  def index
    @spam_emails = SpamEmail.all

SELECT  "spam_types".* FROM "spam_types" WHERE "spam_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def dog
    @spam_type = SpamType.find(session[:spam_type_id])

SELECT  "spam_types".* FROM "spam_types" WHERE "spam_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "spam_emails" ("contents", "user_id", "victim_id", "spam_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "victims" ("real_email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["real_email", "angela.disalvo@gmail.com"], ["created_at", "2018-11-30 22:43:08.026205"], ["updated_at", "2018-11-30 22:43:08.026205"]]
---
  def create
    @spam_type = SpamType.find(session[:spam_type_id])
    @user = User.create(name: params[:spam_email][:user_name], real_email: params[:spam_email][:user_real_email])
    @victim = Victim.create(name: params[:spam_email][:victim_name], real_email: params[:spam_email][:victim_real_email])

    @num_emails = params[:spam_email][:num_emails].to_i

    if(@num_emails && @num_emails > 0 && @num_emails <= 50)
      @num_emails.times do
        @spam_email = SpamEmail.create(contents: params[:spam_email][:contents] , user_id: @user.id , victim_id: @victim.id , spam_type_id: @spam_type.id)