spamjam_backend/app/views/spam_emails/index.html.erb

            <textarea label="All Spams:" rows=20 cols=3>
              <% SpamEmail.all.each do |s| %>
---
SELECT "spam_emails".* FROM "spam_emails"