spamjam_backend/app/views/spam_emails/new1.html.erb

                <%= form.label :spam_type %>
                <%= form.collection_select :spam_type_id, SpamType.all, :id, :name %>
---
SELECT "spam_types".* FROM "spam_types"